# DeleteElement

## Description
Deletes the element at the location specified by the path.

```pascal
FUNCTION DeleteElement(
				XMLHandle   : LONGINT;
				elementPath : DYNARRAY[] of CHAR) : INTEGER;
```

```python

def vs.DeleteElement(XMLHandle, elementPath):
    return INTEGER
```

## Parameters
|Name|Type|Description|
|---|---|---|
|XMLHandle|LONGINT||
|elementPath|DYNARRAY[] of CHAR||

## Version
Availability: from Vectorworks 2011
## Category
* XML